In [1]:
import pandas as pd
import numpy as np

import math as m

from datetime import datetime

## 1. Выполнить преобразование над элементами массива x -> 2 * x + 1

In [2]:
a = [3, 1, 5, 7, 2, 5, 3, 9]

In [3]:
print ([2*aa+1 for aa in a])

[7, 3, 11, 15, 5, 11, 7, 19]

## 2. Поставить в соответствие столбцу value столбец value_tr по правилу:
Да -> 1;
Нет -> -1;
nan -> 0;

In [4]:
df = pd.read_excel('task2.xlsx')

In [5]:
df.head()

   id value
0   0   Нет
1   1    Да
2   2   NaN
3   3    Да
4   4    Да

In [6]:
df['value_tr'] = [1 if a == 'Да' else(-1 if a == 'Нет' else 0) for a in df['value']]
df.head()

   id value  value_tr
0   0   Нет        -1
1   1    Да         1
2   2   NaN         0
3   3    Да         1
4   4    Да         1

## 3. Создать список с уникальными значениями из a

In [7]:
a = [1, 4, 2, 1, 1, 7, 4]

In [8]:
aa = list(set(a))
aa

[1, 2, 4, 7]

## 4. Поставить в соответствие диапазону значений в value столбец value_tr по правилу:
(-inf; 0.15] -> 'A';
(0.15; 0.8] -> 'B';
(0.8; inf) -> 'C';

In [9]:
df = pd.read_excel('task4.xlsx')

In [10]:
df.head()

   id     value
0   0  0.323078
1   1  0.966451
2   2  0.132535
3   3  0.166313
4   4  0.589322

In [11]:
df['value_tr'] = ['A' if float('-inf')< a <= 0.15 else('B' if 0.15 < a <= 0.8 else 'C') for a in df['value']]
df.head()

   id     value value_tr
0   0  0.323078        B
1   1  0.966451        C
2   2  0.132535        A
3   3  0.166313        B
4   4  0.589322        B

## 5. Для каждого id найти второй максимум по value, если значений меньше 2-х, то вывести nan

In [12]:
df = pd.read_excel('task5.xlsx')

In [13]:
df.head()

   id  value
0  15  68840
1  44  25624
2  32  59866
3  14  65180
4  47   3518

In [14]:
def second_max(series):
    value_u = sorted(series.unique(), reverse=True)
    if len(value_u) < 2:
        return float('nan')
    else:
        return value_u[1]
df.groupby('id')['value'].agg(second_max).reset_index()

    id  value
0    0  99303
1    1  97971
2    2  98898
3    3  97780
4    4  99756
..  ..    ...
95  95  91706
96  96  97100
97  97  98393
98  98  97475
99  99  97183

[100 rows x 2 columns]

## 6. Определим признак активного клиента в некоторый месяц, как наличие хотя бы одной транзакции, в противном случае будем считать его неактивным. Будем считать клиента хорошим, если он активен непрерыно в каждый месяц с момента первой активности. Если клиент на протяжении N месяцев был хорошим, после чего стал неактивным и более активным не становился, то такого клиента также будем считать хорошим. Требуется вывести id всех хороших клиентов.

In [15]:
df = pd.read_excel('task6.xlsx')

In [16]:
df.head()

   ind       date  client_id    sum
0    0 2022-09-01         71  55932
1    1 2022-09-01        435  36372
2    2 2022-05-01        665  37711
3    3 2022-04-01        391  21178
4    4 2022-11-01        624  81671

In [19]:
df['month'] = df['date'].dt.month
active_client = df.groupby(['client_id', 'month']).size().reset_index(name='count')
good_client = active_client.groupby('client_id')['month'].agg(lambda a: len(set(a)) == len(set(range(min(a), max(a)+1))))
good_client_id = list(good_client[good_client].index)
print(good_client_id)

[27, 65, 73, 95, 130, 180, 262, 281, 314, 378, 382, 387, 406, 431, 446, 447, 525, 535, 545, 572, 584, 601, 608, 655, 664, 673, 686, 740, 806, 812, 851, 950, 998]